Repository: FluidTYPO3/flux
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# siteConfiguration.tab
source: Flux Providers
de: Flux-Provider

# siteConfiguration.pageTemplates
source: Available page layouts/templates (empty selection means allow-all)
de: Verfügbare Seitenlayouts/-templates (leere Auswahl bedeutet "alles erlaubt")

# siteConfiguration.contentTypes
source: Available content types (empty selection means allow-all)
de: Verfügbare Inhaltselemente (leere Auswahl bedeutet "alles erlaubt")

# content_types
source: Flux-based Content Type
de: Flux-basierte Inhaltselemente

# content_types.extension_identity
source: Extension identity (Vendor.ExtensionName format, should be your own extension). Determines where a partial and layout template files are resolved, and where a controller class may potentially be found.
de: Erweiterungsidentität (Format "Vendor.ExtensionName", sollte deine Erweiterung sein). Legt fest, wo Partials und Layout-Dateien aufgelöst werden, und wo Controllerklassen gefunden werden können.

# content_types.icon
source: Icon file or icon name (if custom icon name you must manually register the icon in TYPO3)
de: Icondatei oder Iconname (wenn es ein eigener Iconname ist, muss der manuell in TYPO3 registriert werden)

# content_types.content_configuration
source: Content type configuration options
de: Inhaltselementkonfiguration

# content_types.grid_configuration
source: Grid configuration options
de: Rasterkonfiguration

# content_types.template_file
source: Template file - if you use this, it overrides "template source" below. If you also enter a source it is available as {contentType.templateSource} in your own template. Use EXT:... file reference format.
de: Template-Datei - wenn das benutzt wird, wird die "Template-Quelle" unten überschrieben. Wenn auch die Template-Quelle eingetragen ist, ist sie als {contentType.templateSource} im Template verfügbar. Nutze das "EXT:..."-Dateireferenzformat

# content_types.template_source
source: Template source
de: Template-Quelle

# content_types.validation
source: Content type validation
de: Inhaltstypenprüfung

# content_types.template_dump
source: Flux template source (copy-paste to template file rendered by Flux)
de: Flux-Template-Quelle (copy-paste in die von Flux gerenderte Templatedatei)

# content_types.sheetName
source: Sheet name (a-z, 0-9 and _)
de: Blattname (a-z, 0-9 und _)

# content_types.sheetLabel
source: Sheet label (any characters you need)
de: Blattbezeichnung (alle Zeichen, die benötigt werden)

# content_types.sheet.context
source: Context
de: Kontext

# content_types.sheet.formFields
source: Form Fields
de: Formularfelder

# content_types.sheet.grid
source: Grid
de: Raster

# content_types.fields.universal.name
source: Field name (a-z, 0-9, _ and .)
de: Feldname (a-z, 0-9, _ and .)

# content_types.fields.universal.label
source: Label, can be LLL:EXT: reference or LLL:keyname which resolves the label in the content type's extension context, file locallang.xlf
de: Bezeichnung, kann eine LLL:EXT:-Referenz oder LLL:keyname sein, der das Label im Kontext der Erweiterung lädt, Datei locallang.xlf

# content_types.fields.universal.transform
source: Data type transformation, enter for example "array" to cast CSV values to array. See Flux documentation about possible values.
de: Datentyptransformation, z.B. "array" um CSV-Werte auf einen Array zu konvertieren. Siehe Flux-Dokumentation für mögliche Werte.

# content_types.fields.universal.clearable
source: Field can be cleared (add "clear" checkbox wizard beside field)
de: Feld kann geleert werden ("Leeren"-Checkbox neben dem Feld)

# content_types.fields.universal.default.value
source: Default value
de: Standardwert

# content_types.fields.universal.default.state
source: Default state
de: Standardzustand

# content_types.fields.input
source: Input
de: Eingabefeld

# content_types.fields.dateTime
source: DateTime
de: Datum + Zeit

# content_types.fields.select.items
source: Items (CSV)
de: Optionen (CSV)

# content_types.fields.relation
source: Relation
de: Verknüpfung

# content_types.fields.relation.size
source: Size of fields (number of possible entries)
de: Größe der Felder (Anzahl möglicher Enträge)

# content_types.fields.relation.minItems
source: Minimum number of items that can be selected
de: Minimale Anzahl an Einträgen, die ausgewählt werden können

# content_types.fields.relation.maxItems
source: Maximum number of items that can be selected
de: Maximale Anzahl an Einträgen, die ausgewählt werden können

# content_types.fields.relation.multiple
source: Allow multiple selections of the same value/record
de: Erlaube mehrfache Auswahl desselben Werts/Datensatzes

# content_types.fields.relation.emptyOption
source: Add an empty option before as first option
de: Füge leere Option vor der ersten Option hinzu

# content_types.fields.relation.foreignTableField
source: Field name on foreign table that contains UID of origin record. Empty means only one item can be related and UID is stored in origin record.
de: Feldname in der Fremdtabelle, der die UID des Originaldatensatzes enthält. Leer bedeutet, daß nur ein Eintrag verknüpft werden kann und die UID im Originaldatensatz gespeichert wird.

# content_types.fields.multiRelation
source: MultiRelation
de: Mehrfachverknüpfung

# content_types.fields.inline
source: Inline
de: Eingebettet

# content_types.fields.file
source: File
de: Datei

# content_types.fields.function
source: Function
de: Funktion

# content_types.fields.function.userFunc
source: User function reference, e.g. MyClass->myFunction. Class must be registered with autoloader to be usable.
de: Benutzerfunktionsreferenz, z.B. MyClass->myFunction. Klasse muss beim Autoloader registriert sein.

# flux.backendLayout.columnsInParent
source: Columns in parent
de: Spalten im Elternelement

# flux.newContentWizard.fluxContent
source: Flux content
de: Flux-Inhalt

# tt_content.tx_flux_options
source: Options
de: Optionen

# tt_content.pi_flexform
source: Content-type options
de: Inhaltstypoptionen

# flux.clearValue
source: Clear value
de: Wert leeren

# flux.clearValue.help
source: Destroy the value that is saved in the database, allowing the value to either be inherited again from a parent or reset to the default value if there is no inherited value.
de: Lösche den Wert, der in der Datenbank gespeichert ist. Damit kann der Wert entweder von einem Elterndatensatz geerbt werden, oder wird auf den Standardwert gesetzt, wenn es keinen geerbten Wert gibt.

# flux.protectValue
source: Protect value
de: Wert schützen

# flux.protectValue.help
source: Protected values will remain the same even if the (inherited) value changes in a parent record.
de: Geschützte Werte werden gleich bleiben, auch wenn sich der (geerbte) Wert im Elterndatensatz ändert.

# reference
source: Reference to content on page '%s' - click to jump to original
de: Referenz zu Inhalt auf Seite '%s' - klicken, um zum Original zu springen

# user.no_fields
source: No fields found in form
de: Keine Felder in diesem Formular gefunden

# user.no_selection
source: No form selected/configured (enabling Flux debug will produce more information)
de: Kein Formular ausgewählt/konfiguriert (Aktivieren von Flux-Debug wird mehr Informationen liefern)

# new
source: Insert new content element in this position
de: Neues Inhaltselement an dieser Stelle einfügen

# paste
source: Paste in this position
de: An dieser Stelle einfügen

# paste_reference
source: Paste as reference in this position
de: An dieser Stelle als Referenz einfügen

# toggle_content
source: Show or hide the grid
de: Raster anzeigen oder verstecken

# flux.grid.grids.grid
source: Columns from selected "Page Layout"
de: Spalten vom gewählten Seitenlayout

# pages.tx_fed_page_controller_action
source: Page Layout - this page
de: Seitenlayout - diese Seite

# pages.tx_fed_page_controller_action.default
source: Parent decides
de: Elternseite entscheidet

# pages.tx_fed_page_controller_action_sub
source: Page Layout - subpages
de: Seitenlayout - Unterseiten

# pages.tx_fed_page_flexform
source: Page Configuration
de: Seitenkonfiguration

# pages.tx_fed_page_flexform_sub
source: Page Configuration - subpages
de: Seitenkonfiguration - Unterseiten

# pages.tx_fed_page_package
source: Package
de: Paket

# pages.tx_fed_page_layoutselect
source: Page Layouts
de: Seitenlayouts

# pages.tx_fed_page_configuration
source: Page Configuration
de: Seitenkonfiguration

# pages.doktype.187
source: Raw Fluid template
de: Reines Fluid-Template

# pages.tx_fluidpages_templatefile
source: Template file reference
de: Template-Datei-Referenz

# pages.tx_fluidpages_templatefile.placeholder
source: EXT:... or site-relative path
de: EXT:... oder site-relativer Pfad

# pages.tx_fluidpages_layout
source: Layout to use for rendering
de: Layout zur Anzeige

source: Fluid Content Area
de: Fluid-Inhaltsbereich
